{
 "biz_name": [
  {
   "desc": "It certainly lives up to all the rave reviews. We were the last guests and they treated us so well. They were so welcoming and the waiters were great. The manager came over to our table and seemed genuinely happy to have us as guests even though we were late.\nCute little restaurant that probably holds at one time 60 people at most. It's one of those places that you will have to be patient to have the full experience. But they do warn you in the menu about the approximate wait time. Lucky for us, we were the last customers so our food came out quickly.\nMy husband and I agree that we will certainly be back. It's a far distance from where we currently live. But we don't mind to patron this restaurant for date night every once and awhile.",
   "reviews": "116 reviews"
  },
  {
   "desc": "After 4 amazing experiences at Café Matisse, I can now comfortably say it's top of my list for fine dining restaurants! Close second would Del-Frisco's stake house (the Manhattan location).\nAs soon as you step foot in the door, the warm ambience and quint decor just set the mood that you're about to have an \"out of this world\" experience. The wait staff is super attentive and are ready to cater to your every need from start to finish. They are very knowledgeable of the menue and give quite an appetizing description of their feature dishes. (I believe the menu changes every season with the exception of a couple of staple items).\nNow the food - where do I begin! Did I mention \"out of this world!\"? I have yet to take a bite of anything there that was short of amazing! My personal favorite of all time is the panko crab cake with the jumbo shrimp on top. To say that this dish is delicious would be understatement. It's just a masterpiece cooked to perfection, and meant to do wonders to your taste pallets as you savor it! I honestly wouldn't do it it justice by trying to describe it further. Hats off to the chef. Do yourself a favor, get that dish. Thank me later\nI think the prime rib burger is another staple on the menue. Another great selection. Pan seared scallops are always a great options and so is the duck.\nFYI- It's a prix fix menue with the lowest price point starting at 3 items on the menu. Don't judge the portion sizes. I went with the 4 items option once, and ended up taking one of them home because I was that full! Also it's BYOB so grab yourself a bottle of your favorite vino and enjoy. (I'm already planning my next visit!)",
   "reviews": "37 reviews"
  },
  {
   "desc": "Stellar meal. Great food with charming ambiance. Ordered stone crab claw special, lobster pasta, scallop risotto, Osso buco and 2 desserts. Everything was very tasty. Especially enjoyed the lobster pasta. Service was a little slow probably because we over ordered but given the right ambiance and company, it's not a big deal.",
   "reviews": "11 reviews"
  },
  {
   "desc": "My friend bought me a certificate for my birthday so we went together on a nice evening and had a seat outside in the adorable outdoor patio.\nI went with the 4 course meal (3 savory, 1 sweet) Sadly I did not take a pic of the menu and it was different from what's online so I'll try my best.\n1) Scallops with Fried Oyster\n2) Spicy Panko Crusted Crab Cake & Cheddar Glazed Shrimp\n3) Pork Loin w Apple Chutney, Asparagus and Puréed Parnips\n4) Honey Vanilla Soaked Banana Cake\nEverything was pretty outstanding. Portions were quite large, I was very much done after dessert. Service was very pleasant and attentive. Would love to come back different seasons for the ever changing menu.",
   "reviews": "431 reviews"
  },
  {
   "reviews": "10 reviews"
  },
  {
   "desc": "Food amazing, the portions weren't small. I chose the 3 course and 1 dessert, it was a lot of food ! Very satisfied! The place is romantic and cozy.",
   "reviews": "2 reviews"
  },
  {
   "reviews": "92 reviews"
  },
  {
   "desc": "Great food, nice ambiance - good service. Great for a special occasion. Loot but worth it if you're a foodie",
   "reviews": "3 reviews"
  },
  {
   "desc": "Delightful, rich experience here for a birthday dinner. Menu is prix-fixe only but you can choose 3, 4, or 5 courses\nWe opted for the 5-course dinner so basically got to try all the savory dishes\nThe menu descriptions of the dishes are a little misleading and don't do the actual dish justice. First of all, we enjoyed everything. Everything had flavors that were big and bold. We were a party of two and the serving size of each dish was adequate enough to share . It helped too to opt for the 5-course and each bite was satisfying . I can't recommend one dish over another because each dish was special\nFor desserts, we tried the banana cake and the key lime tart. Both were light and easy to eat after the eight savory dishes. The key lime tart was a little more refreshing because of the citrus but both were delicious\nStaff is attentive and friendly. It was a cold night and the garden looked pretty to dine outside when weather is warmer",
   "reviews": "500 reviews"
  },
  {
   "desc": "You cannot say ANYTHING negative about this place. Food service and ambiance unbeatable ! We wish we could eat here all the time !\nPeter and Larry make you feel so comfortable - can't wait to go back. Soon!!!",
   "reviews": "118 reviews"
  },
  {
   "desc": "Top notch cuisine. Hidden Gem is exactly how i would describe this place. If you like fine dining, you need to visit this place ASAP! Our dishes were superb. We all had different dishes as we wanted to try it all. One thing I will mention is that the service takes a little longer than usual and it's because each dish is made with such detail that when you see, smell and taste your dish you will 100% understand. This place has a beautiful and cozy patio. Some bring your best bottle or wine and unwind. Thank you to the owner who is an absolute delight! We will be back soon!",
   "reviews": "47 reviews"
  },
  {
   "reviews": "5 reviews"
  },
  {
   "reviews": "53 reviews"
  },
  {
   "desc": "Easily one of my favorite places in the area! I have come here for various occasions (date night, birthday, girls night out); every time has been consistently amazing. From the impeccable service to the jaw-dropping food, that is not only aesthetically pleasing but filled with rich flavor, too. Each season the chef changes the menu, keeping some of their staple favorites. Fall, spring, or summer- you are getting everything you could want and more, it's worth every penny. LOVE this place- Rutherford's hidden gem!!",
   "reviews": "23 reviews"
  },
  {
   "desc": "I surprised my friend by taking him here for his birthday. The atmosphere was very lovely and romantic. The lights were dim but not too dark, every table had a candle lit. Upon meeting the Matradee he asked if we brought any wine or beer, since the place is BYOB. If you didn't don't worry he recommends you to a liquor store not too far. He was very charming and all the waiters were very attentive. I ordered two 5 course meals for the both of us which comes 4 Savory dishes and 1 Dessert each. Every course was full of multiple flavors and was very delectable. My friend being use to taco bell and fast food was incredibly overwhelm by whatever was on his plate. Cafe Matisse does offer a Burger and Wing entree and before you ask no you do not have to fork and knife it. ^_^\nMy personal favorite dishes were Spicy Panko Crusted Crab Cake & Cheddar Glazed Shrimp and Honey Vanilla Soaked Banana Cake",
   "reviews": "11 reviews"
  },
  {
   "desc": "High end cuisine. Every dish was very well made with beautiful combinations of flavor. Prefix menu set up.\nCafé Matisse in Rutherford. Little hole in the wall, probably would drive right past it in most cases. The outdoor seating is beautiful. Looks like you're in the middle of a garden in what feels like an escape out of New Jersey.\nVery elegant with great service. 3 course $75 4 course $95 5 course $115. We ended up doing 7 courses total. BYOB - they kept my wine on ice and my glass full without ever having to ask for anything.\nDefinitely a special occasion.",
   "reviews": "323 reviews"
  },
  {
   "desc": "Could be the best restaurant in not only Bergen County but possibly NJ. Chef/ owner Peter Loris is a kitchen wizard creating unusual combinations of various food items that become extremely tasty & satisfying. Beautiful, romantic dining room with a magnificent garden for outdoor dining. Food is spectacular, service is friendly and professional, prices are high but acceptable. BYO & only street parking.",
   "reviews": "10 reviews"
  },
  {
   "desc": "Had the best Anniversary dinner date at Cafe Matisse!!! The owner is the best and super nice!!! The food were fantastic! My boyfriend and I loved and enjoyed this place so much! We'll def come back here again but we'll def try to get seated outside. Thank you for the great service and food ESP our gift .",
   "reviews": "9 reviews"
  },
  {
   "desc": "My first time trying out a tasting menu. I ordered 4 different courses. Servers were helpful and attentive; opened both our bottles of wine-- one white, one red. Started with the scallops and pecan foie Gras truffle which was amazing/interesting. Second course was their number one dish, the spicy Panko crusted crab cake with cheddar glazed shrimp. Peppered steak course with a piece of shrimp was okay, not great or as flavorful as I thought it would be. Last course was dessert a nice brownie with peanut butter. It was okay, I don't really like fudge brownies. Service was great and the food was pretty good, might return next season for the latest and greatest menu options.",
   "reviews": "179 reviews"
  },
  {
   "desc": "I've yet to find a restaurant I enjoy more. Yes it is expensive. The food is outstanding, service is perfect and there is no snobby attitude. I've had some great family dinners there as well as dinner for four and everyone\nloves the place. I'll leave it to others to describe the food and atmosphere. Only restaurant where I consider myself lucky to get to eat there.",
   "reviews": "3 reviews"
  },
  {
   "desc": "Absolutely impeccable service, only to be outshined by the sublime food. Really a wonderful experience for any occasion, and always remember to invite Larry (the owner) to enjoy a glass of wine with you in this BYO restaurant (Rutherford is a dry town). We always leave feeling immensely full and extremely undercharged!",
   "reviews": "48 reviews"
  },
  {
   "reviews": "2 reviews"
  },
  {
   "desc": "Food was good not great. Expected more from a five course at $115. Service could've been a lot better. For example, when we ordered the five course servers should've kept track of what order goes to what guest; if it was only 3 of us. Desert was probably the best part. For the price and our experience as first timers probably won't come back.",
   "reviews": "8 reviews"
  },
  {
   "reviews": "7 reviews"
  },
  {
   "reviews": "10 reviews"
  },
  {
   "reviews": "51 reviews"
  },
  {
   "reviews": "274 reviews"
  },
  {
   "reviews": "2 reviews"
  },
  {
   "reviews": "24 reviews"
  },
  {
   "desc": "I'm glad that I've finally tried this place that I've bookmarked for so long. However not sure if I'll return anytime soon. The food is prepared with effort and care, the service was attentive and warm, the dining room is lovely, but I just don't think I want to pay $75 for app, entree, and dessert. I feel like I can get something comparable or better in the city for that price.\nSome dishes I enjoyed were the panko crusted crab cake and shrimp, which is always on the menu. It was tasty, but the corn bread was a tad bit salty for me. Liked the truffley foie gras with scallops. The burger was ok. Fries that came with it were meh. There was a confusion with the order so it was delivered to the wrong table. Sat there for a bit and sent back to the kitchen. Then it was delivered to me,so it wasn't hot as it should have been. Perhaps it would have tasted better had it come hotter. This dish is pretty hearty although it seems small at first. Didn't enjoy the shrimp and crab gazpacho so much. However the seafood is very fresh. Dessert was just so so for me.\nIf you want a special occasion, fine dining option in NJ then give it a try. But for me, there are better options in the city.",
   "reviews": "226 reviews"
  },
  {
   "desc": "One of the best dining experiences I have had in New Jersey. The sea bass was sublime and excellent. The scallops were so flavorful. Chocolate tart was fantastic and had a lot going on. The burger is good, but it is very rich and heavy, so you may have to watch how many courses you order if you are getting the burger because it is very filling.",
   "reviews": "24 reviews"
  },
  {
   "desc": "For those of you with a restaurant bucket list, Cafe Matisse must be at the top. While certainly not an everyday spot (unless you have that kind of cash in which case all the more power to you), it is such a lovely treat for any special occasion. My boyfriend surprised me with dinner here for our anniversary and we were treated so well the entire night. The host and the waiters all wished us a happy anniversary and I must say that, while it's a seemingly small thing, the personalized treatment felt great.\nThe unique decor is really welcoming and they're pretty serious about really it making an experience. It's supposed to be a roughly 2 hour experience so make sure that you have that time or let them know if you don't. It's BYOB so bring a bottle (or two) of your favorite wine to enjoy throughout the process.\nI think the menu changes seasonally but I'll still tell you about the cool things we ate (which you can also see in the photos).\n- Sliced Tuna: Super fresh and great quality tuna. I felt like the flatbread was a bit chewy and hard but really enjoy the toppings on it.\n- Pan Seared Scallop: Delicious, sweet scallops and the addition of the crab meat was a nice touch.\n- Spicy Panko Crab: Had a nice kick to it. I was hoping it would be a little spicier because the waiter really hyped up how spicy it is, but the flavors were delicious all the same. Loved the giant shrimp on top too!\n- Matisse Burger: Great quality meat but I'm not sure how the wings play into it. The wings kind of threw us off because on one hand you're in a super fancy restaurant but on the other hand you're eating messy wings with your hands. BUT the wings were delicious, despite being out of place.\n- Whole Wheat Brown Butter Cake: The desserts here are amazing. The butter cake was something new I've never really had before but I'd say it resembled a super soft, crumbly sugar cookie.\nI'm definitely going to recommend this place to anyone and everyone! MUST MUST MUST TRY!",
   "reviews": "493 reviews"
  },
  {
   "desc": "Having dined in wonderful restaurants both domestically and internationally, Cafe Matisse ranks with the best. The staff welcomes you as family. We dined at a beautiful table for two in the outdoor garden. 3,4 or 5 course dinner offered. For us , 3 course option works best. No point discussing menu because it's always evolving. Everything was beautifully presented and tasted great. Expect a 2 + hour dining experience, which is NOT a criticism. Matisse is an experience to be savored. We can't imagine a more romantic setting. Note: Larry and entire staff are amazing. 10% cash discount.",
   "reviews": "13 reviews"
  },
  {
   "desc": "Our fourth time and definitely not the last. The food is outstanding, service is outstanding and it was yet another memorable evening. We decided to try the five course and as usual it did not disappoint! Actually I am stuffed! I love this place and every room both inside and out gives a different experience. This evening we were in the garden and it was so lovely. Unfortunately there were a lot of planes flying above from teterboro but then you kind of forget it. This is the place for special occasions proposals etc. I love love Cafe Matisse!!!",
   "reviews": "43 reviews"
  },
  {
   "reviews": "13 reviews"
  },
  {
   "reviews": "15 reviews"
  },
  {
   "reviews": "3 reviews"
  },
  {
   "reviews": "20 reviews"
  },
  {
   "desc": "We went there because it was supposedly one of the best French restaurants in NJ and it didn't disappoint! The portions were smaller but full of rich delicious flavor and I have to admit I was stuffed after three courses. The artichoke/goat cheese coarse and scallop/duck coarse did nothing but tantalize our taste buds. The waiting staff was so attentive of our needs at every point of the meal even in the beginning when my husband didn't realize it was BYOB and ran out real quick to grab a bottle of red. If you are a French food fanatic like I am I highly suggest it taking a visit to this place! We drove over an hour to go there and it was totally worth it!",
   "reviews": "7 reviews"
  },
  {
   "reviews": "2 reviews"
  },
  {
   "desc": "It certainly lives up to all the rave reviews. We were the last guests and they treated us so well. They were so welcoming and the waiters were great. The manager came over to our table and seemed genuinely happy to have us as guests even though we were late.\nCute little restaurant that probably holds at one time 60 people at most. It's one of those places that you will have to be patient to have the full experience. But they do warn you in the menu about the approximate wait time. Lucky for us, we were the last customers so our food came out quickly.\nMy husband and I agree that we will certainly be back. It's a far distance from where we currently live. But we don't mind to patron this restaurant for date night every once and awhile.",
   "reviews": "116 reviews"
  },
  {
   "desc": "After 4 amazing experiences at Café Matisse, I can now comfortably say it's top of my list for fine dining restaurants! Close second would Del-Frisco's stake house (the Manhattan location).\nAs soon as you step foot in the door, the warm ambience and quint decor just set the mood that you're about to have an \"out of this world\" experience. The wait staff is super attentive and are ready to cater to your every need from start to finish. They are very knowledgeable of the menue and give quite an appetizing description of their feature dishes. (I believe the menu changes every season with the exception of a couple of staple items).\nNow the food - where do I begin! Did I mention \"out of this world!\"? I have yet to take a bite of anything there that was short of amazing! My personal favorite of all time is the panko crab cake with the jumbo shrimp on top. To say that this dish is delicious would be understatement. It's just a masterpiece cooked to perfection, and meant to do wonders to your taste pallets as you savor it! I honestly wouldn't do it it justice by trying to describe it further. Hats off to the chef. Do yourself a favor, get that dish. Thank me later\nI think the prime rib burger is another staple on the menue. Another great selection. Pan seared scallops are always a great options and so is the duck.\nFYI- It's a prix fix menue with the lowest price point starting at 3 items on the menu. Don't judge the portion sizes. I went with the 4 items option once, and ended up taking one of them home because I was that full! Also it's BYOB so grab yourself a bottle of your favorite vino and enjoy. (I'm already planning my next visit!)",
   "reviews": "37 reviews"
  },
  {
   "desc": "Stellar meal. Great food with charming ambiance. Ordered stone crab claw special, lobster pasta, scallop risotto, Osso buco and 2 desserts. Everything was very tasty. Especially enjoyed the lobster pasta. Service was a little slow probably because we over ordered but given the right ambiance and company, it's not a big deal.",
   "reviews": "11 reviews"
  },
  {
   "desc": "My friend bought me a certificate for my birthday so we went together on a nice evening and had a seat outside in the adorable outdoor patio.\nI went with the 4 course meal (3 savory, 1 sweet) Sadly I did not take a pic of the menu and it was different from what's online so I'll try my best.\n1) Scallops with Fried Oyster\n2) Spicy Panko Crusted Crab Cake & Cheddar Glazed Shrimp\n3) Pork Loin w Apple Chutney, Asparagus and Puréed Parnips\n4) Honey Vanilla Soaked Banana Cake\nEverything was pretty outstanding. Portions were quite large, I was very much done after dessert. Service was very pleasant and attentive. Would love to come back different seasons for the ever changing menu.",
   "reviews": "431 reviews"
  },
  {
   "reviews": "10 reviews"
  },
  {
   "desc": "Food amazing, the portions weren't small. I chose the 3 course and 1 dessert, it was a lot of food ! Very satisfied! The place is romantic and cozy.",
   "reviews": "2 reviews"
  },
  {
   "reviews": "92 reviews"
  },
  {
   "desc": "Great food, nice ambiance - good service. Great for a special occasion. Loot but worth it if you're a foodie",
   "reviews": "3 reviews"
  },
  {
   "desc": "Delightful, rich experience here for a birthday dinner. Menu is prix-fixe only but you can choose 3, 4, or 5 courses\nWe opted for the 5-course dinner so basically got to try all the savory dishes\nThe menu descriptions of the dishes are a little misleading and don't do the actual dish justice. First of all, we enjoyed everything. Everything had flavors that were big and bold. We were a party of two and the serving size of each dish was adequate enough to share . It helped too to opt for the 5-course and each bite was satisfying . I can't recommend one dish over another because each dish was special\nFor desserts, we tried the banana cake and the key lime tart. Both were light and easy to eat after the eight savory dishes. The key lime tart was a little more refreshing because of the citrus but both were delicious\nStaff is attentive and friendly. It was a cold night and the garden looked pretty to dine outside when weather is warmer",
   "reviews": "500 reviews"
  },
  {
   "desc": "You cannot say ANYTHING negative about this place. Food service and ambiance unbeatable ! We wish we could eat here all the time !\nPeter and Larry make you feel so comfortable - can't wait to go back. Soon!!!",
   "reviews": "118 reviews"
  },
  {
   "desc": "Top notch cuisine. Hidden Gem is exactly how i would describe this place. If you like fine dining, you need to visit this place ASAP! Our dishes were superb. We all had different dishes as we wanted to try it all. One thing I will mention is that the service takes a little longer than usual and it's because each dish is made with such detail that when you see, smell and taste your dish you will 100% understand. This place has a beautiful and cozy patio. Some bring your best bottle or wine and unwind. Thank you to the owner who is an absolute delight! We will be back soon!",
   "reviews": "47 reviews"
  },
  {
   "reviews": "5 reviews"
  },
  {
   "reviews": "53 reviews"
  },
  {
   "desc": "Easily one of my favorite places in the area! I have come here for various occasions (date night, birthday, girls night out); every time has been consistently amazing. From the impeccable service to the jaw-dropping food, that is not only aesthetically pleasing but filled with rich flavor, too. Each season the chef changes the menu, keeping some of their staple favorites. Fall, spring, or summer- you are getting everything you could want and more, it's worth every penny. LOVE this place- Rutherford's hidden gem!!",
   "reviews": "23 reviews"
  },
  {
   "desc": "I surprised my friend by taking him here for his birthday. The atmosphere was very lovely and romantic. The lights were dim but not too dark, every table had a candle lit. Upon meeting the Matradee he asked if we brought any wine or beer, since the place is BYOB. If you didn't don't worry he recommends you to a liquor store not too far. He was very charming and all the waiters were very attentive. I ordered two 5 course meals for the both of us which comes 4 Savory dishes and 1 Dessert each. Every course was full of multiple flavors and was very delectable. My friend being use to taco bell and fast food was incredibly overwhelm by whatever was on his plate. Cafe Matisse does offer a Burger and Wing entree and before you ask no you do not have to fork and knife it. ^_^\nMy personal favorite dishes were Spicy Panko Crusted Crab Cake & Cheddar Glazed Shrimp and Honey Vanilla Soaked Banana Cake",
   "reviews": "11 reviews"
  },
  {
   "desc": "High end cuisine. Every dish was very well made with beautiful combinations of flavor. Prefix menu set up.\nCafé Matisse in Rutherford. Little hole in the wall, probably would drive right past it in most cases. The outdoor seating is beautiful. Looks like you're in the middle of a garden in what feels like an escape out of New Jersey.\nVery elegant with great service. 3 course $75 4 course $95 5 course $115. We ended up doing 7 courses total. BYOB - they kept my wine on ice and my glass full without ever having to ask for anything.\nDefinitely a special occasion.",
   "reviews": "323 reviews"
  },
  {
   "desc": "Could be the best restaurant in not only Bergen County but possibly NJ. Chef/ owner Peter Loris is a kitchen wizard creating unusual combinations of various food items that become extremely tasty & satisfying. Beautiful, romantic dining room with a magnificent garden for outdoor dining. Food is spectacular, service is friendly and professional, prices are high but acceptable. BYO & only street parking.",
   "reviews": "10 reviews"
  },
  {
   "desc": "Had the best Anniversary dinner date at Cafe Matisse!!! The owner is the best and super nice!!! The food were fantastic! My boyfriend and I loved and enjoyed this place so much! We'll def come back here again but we'll def try to get seated outside. Thank you for the great service and food ESP our gift .",
   "reviews": "9 reviews"
  },
  {
   "desc": "My first time trying out a tasting menu. I ordered 4 different courses. Servers were helpful and attentive; opened both our bottles of wine-- one white, one red. Started with the scallops and pecan foie Gras truffle which was amazing/interesting. Second course was their number one dish, the spicy Panko crusted crab cake with cheddar glazed shrimp. Peppered steak course with a piece of shrimp was okay, not great or as flavorful as I thought it would be. Last course was dessert a nice brownie with peanut butter. It was okay, I don't really like fudge brownies. Service was great and the food was pretty good, might return next season for the latest and greatest menu options.",
   "reviews": "179 reviews"
  },
  {
   "desc": "I've yet to find a restaurant I enjoy more. Yes it is expensive. The food is outstanding, service is perfect and there is no snobby attitude. I've had some great family dinners there as well as dinner for four and everyone\nloves the place. I'll leave it to others to describe the food and atmosphere. Only restaurant where I consider myself lucky to get to eat there.",
   "reviews": "3 reviews"
  },
  {
   "desc": "Absolutely impeccable service, only to be outshined by the sublime food. Really a wonderful experience for any occasion, and always remember to invite Larry (the owner) to enjoy a glass of wine with you in this BYO restaurant (Rutherford is a dry town). We always leave feeling immensely full and extremely undercharged!",
   "reviews": "48 reviews"
  },
  {
   "reviews": "2 reviews"
  },
  {
   "desc": "Food was good not great. Expected more from a five course at $115. Service could've been a lot better. For example, when we ordered the five course servers should've kept track of what order goes to what guest; if it was only 3 of us. Desert was probably the best part. For the price and our experience as first timers probably won't come back.",
   "reviews": "8 reviews"
  },
  {
   "reviews": "7 reviews"
  },
  {
   "reviews": "10 reviews"
  },
  {
   "reviews": "51 reviews"
  },
  {
   "reviews": "274 reviews"
  },
  {
   "reviews": "2 reviews"
  },
  {
   "reviews": "24 reviews"
  },
  {
   "desc": "I'm glad that I've finally tried this place that I've bookmarked for so long. However not sure if I'll return anytime soon. The food is prepared with effort and care, the service was attentive and warm, the dining room is lovely, but I just don't think I want to pay $75 for app, entree, and dessert. I feel like I can get something comparable or better in the city for that price.\nSome dishes I enjoyed were the panko crusted crab cake and shrimp, which is always on the menu. It was tasty, but the corn bread was a tad bit salty for me. Liked the truffley foie gras with scallops. The burger was ok. Fries that came with it were meh. There was a confusion with the order so it was delivered to the wrong table. Sat there for a bit and sent back to the kitchen. Then it was delivered to me,so it wasn't hot as it should have been. Perhaps it would have tasted better had it come hotter. This dish is pretty hearty although it seems small at first. Didn't enjoy the shrimp and crab gazpacho so much. However the seafood is very fresh. Dessert was just so so for me.\nIf you want a special occasion, fine dining option in NJ then give it a try. But for me, there are better options in the city.",
   "reviews": "226 reviews"
  },
  {
   "desc": "One of the best dining experiences I have had in New Jersey. The sea bass was sublime and excellent. The scallops were so flavorful. Chocolate tart was fantastic and had a lot going on. The burger is good, but it is very rich and heavy, so you may have to watch how many courses you order if you are getting the burger because it is very filling.",
   "reviews": "24 reviews"
  },
  {
   "desc": "For those of you with a restaurant bucket list, Cafe Matisse must be at the top. While certainly not an everyday spot (unless you have that kind of cash in which case all the more power to you), it is such a lovely treat for any special occasion. My boyfriend surprised me with dinner here for our anniversary and we were treated so well the entire night. The host and the waiters all wished us a happy anniversary and I must say that, while it's a seemingly small thing, the personalized treatment felt great.\nThe unique decor is really welcoming and they're pretty serious about really it making an experience. It's supposed to be a roughly 2 hour experience so make sure that you have that time or let them know if you don't. It's BYOB so bring a bottle (or two) of your favorite wine to enjoy throughout the process.\nI think the menu changes seasonally but I'll still tell you about the cool things we ate (which you can also see in the photos).\n- Sliced Tuna: Super fresh and great quality tuna. I felt like the flatbread was a bit chewy and hard but really enjoy the toppings on it.\n- Pan Seared Scallop: Delicious, sweet scallops and the addition of the crab meat was a nice touch.\n- Spicy Panko Crab: Had a nice kick to it. I was hoping it would be a little spicier because the waiter really hyped up how spicy it is, but the flavors were delicious all the same. Loved the giant shrimp on top too!\n- Matisse Burger: Great quality meat but I'm not sure how the wings play into it. The wings kind of threw us off because on one hand you're in a super fancy restaurant but on the other hand you're eating messy wings with your hands. BUT the wings were delicious, despite being out of place.\n- Whole Wheat Brown Butter Cake: The desserts here are amazing. The butter cake was something new I've never really had before but I'd say it resembled a super soft, crumbly sugar cookie.\nI'm definitely going to recommend this place to anyone and everyone! MUST MUST MUST TRY!",
   "reviews": "493 reviews"
  },
  {
   "desc": "Having dined in wonderful restaurants both domestically and internationally, Cafe Matisse ranks with the best. The staff welcomes you as family. We dined at a beautiful table for two in the outdoor garden. 3,4 or 5 course dinner offered. For us , 3 course option works best. No point discussing menu because it's always evolving. Everything was beautifully presented and tasted great. Expect a 2 + hour dining experience, which is NOT a criticism. Matisse is an experience to be savored. We can't imagine a more romantic setting. Note: Larry and entire staff are amazing. 10% cash discount.",
   "reviews": "13 reviews"
  },
  {
   "desc": "Our fourth time and definitely not the last. The food is outstanding, service is outstanding and it was yet another memorable evening. We decided to try the five course and as usual it did not disappoint! Actually I am stuffed! I love this place and every room both inside and out gives a different experience. This evening we were in the garden and it was so lovely. Unfortunately there were a lot of planes flying above from teterboro but then you kind of forget it. This is the place for special occasions proposals etc. I love love Cafe Matisse!!!",
   "reviews": "43 reviews"
  },
  {
   "reviews": "13 reviews"
  },
  {
   "reviews": "15 reviews"
  },
  {
   "reviews": "3 reviews"
  },
  {
   "reviews": "20 reviews"
  },
  {
   "desc": "We went there because it was supposedly one of the best French restaurants in NJ and it didn't disappoint! The portions were smaller but full of rich delicious flavor and I have to admit I was stuffed after three courses. The artichoke/goat cheese coarse and scallop/duck coarse did nothing but tantalize our taste buds. The waiting staff was so attentive of our needs at every point of the meal even in the beginning when my husband didn't realize it was BYOB and ran out real quick to grab a bottle of red. If you are a French food fanatic like I am I highly suggest it taking a visit to this place! We drove over an hour to go there and it was totally worth it!",
   "reviews": "7 reviews"
  },
  {
   "reviews": "2 reviews"
  },
  {
   "desc": "This is my go to spot for any Special occasion. I'm the type of guy that always has a hard time picking between dishes\"should I get this should I get that and the always that's looks great I knew I should have gotten that\" but with this Menu I get a little of everything and I'm always happy. So if you and someone you love are looking for a great night out this is a Wonderful choice. If you plan on sitting outside call a few days ahead? The outside garden fills up quick.",
   "reviews": "1 review"
  },
  {
   "desc": "I am so happy we stumbled upon this cute little restaurant. Hubbs and I were in Jersey, on our way to a concert so we weren't quite dressed for this type of establishment but we didn't have many options and the reviews were just too good to pass up. I made reservations as we were driving and they had plenty of seating available. I read that they're BYOB so we stopped a few blocks away at a liquor store and picked up a bottle of vodka; hubby can't drink wine so we pickup something we could both enjoy.\nWe were seated immediately upon arrival and the staff was very nice; I'm sure we received a lot of double takes because of how we were dressed but they were still very gracious and didn't make us feel unwelcome. I loved the dining room decor; apparently, they redecorate the dining room and we visited when is was the jewelry box theme. It made me feel like we were in an Alice In Wonderland story. The concept of their menu is pre fixe and you have a choice of how many courses you would like. All of the dishes are small plates and you choose each course, paying one price for either 3, 4 or 5 courses. Each choice includes a dessert course and a number of savory courses, adding up to the option you chose. We asked for a chaser for our vodka and they offered us juice to make mixed drinks at the table.\nHubbs started off with Tacos and loved them. I had what was supposed to be Diver Scallops but instead were very large sea scallops that were sliced. I compared my dish to the same dish someone else posted and I was definitely lacking scallop girth, but I digress. The food is phenomenal and regardless of my scallop size, it is evident that Chef Loria takes great pleasure in producing such fine works of edible art.\nFor our second course, hubbs enjoyed the Bison Medallion with Onion Ribbons and I loved my Venison with Bay Scallops. We each had a dessert as well, my Bittersweet Chocolate Tart and his hubby's Key Lime Pie. Everything was detectable; we enjoyed every single bite and our dining experience was worth the awkwardness in the beginning. The menu changes, seasonally, so the concept may be similar but the proteins may be different from menu to menu. I definitely want to go back and check out their new dining room which is supposedly a Moroccan theme now but I think we'll dress up a bit for our next visit.",
   "reviews": "1047 reviews"
  },
  {
   "desc": "If I only had one word for the review, it would be phenomenal. I was looking for a restaurant to go to for a celebration dinner. I stumbled upon this place by reading an article about the top 5 most expensive restaurants in NJ and this was on the list. So after choosing this place I had to make a reservation 2 weeks in advance to get a Friday night dinner.\nOnce we walked into the restaurant it reeked of freshly baked brownies. Def a good thing cause it smelled great. Then a man asked if I was David after I said yes he greeted us and brought us to our table. I felt very special that he knew my name. He would be our host/waiter and I liked him a lot. A very nice man who made us feel very welcome. As soon as we sat he complimented me on my bottle of VSOP cognac. This made me feel extra happy because I was a little nervous about bringing in liquor that wasn't beer or wine. After that, they brought us a wine glass for my wife and a snifter for my cognac. With the 2 glasses came a glass full of different olives, this was nice to munch on while we had our first drink and looked at the menu. This place was batting a thousand so far.\nThe host then explained how the menu works. You choose either a 3-course meal (75$) or a 4-course meal (95$). Dessert counts as a course so I went with the 4-course meal. Then the host told us to not be in a rush because the whole experience would take about 2 hours. I loved this, all week we work hard and eat in a rush so we could move on quicker. This was nice to take our time relax, have a drink, and enjoy each others company while we eat a superb meal.\nThe ambience was great, dim lighting and a candlelit dinner. They also look like they have an area in the back that's outdoor. I will definitely sit there next time it's hot. The service was impeccable with water always filled and new forks and knives for each course.\nFor my 4 courses, I chose the tuna and crudo, crab cake, and duck to finish. Every course was amazing. It was like my taste buds went on vacation. Each dish had so much going on it made me want to get each ingredient on every bite. This is the best dining experience I've had in new jersey, maybe even my life. Everything was cooked perfectly and I wish I could come here more often. It's expensive so I can only come here for special occasions.\nI got the butter cake for dessert which was delicious but it paled in comparison to the complex flavors of the main courses. Then I ended with a macchiato coffee. It was the tastiest coffee I've ever had.\nAll in all this dinner was worth every penny. It was a great night out with my lovely wife. This restaurant should be treated like going to the opera or an expensive concert. If you're a foodie, experience it for yourself.",
   "reviews": "124 reviews"
  },
  {
   "reviews": "4 reviews"
  },
  {
   "reviews": "443 reviews"
  },
  {
   "reviews": "6 reviews"
  },
  {
   "reviews": "152 reviews"
  },
  {
   "desc": "Our absolute favorite spot for special occasions. Larry is the man. The outdoor garden is majestic.",
   "reviews": "3 reviews"
  },
  {
   "desc": "A little disappointed on the taste...compared to its overall rates, the price and where it wants to go. Service, and atmosphere are great though. Worth a try then it will up to you if you are coming back. Also note they dont sell wine/alcohol, but welcome you to bring your own.",
   "reviews": "47 reviews"
  },
  {
   "desc": "I set out searching for a French restaurant in the area and Cafe Matisse came up on Yelp as American Cuisine ( substitute for French) For starters - the menu is a weird scheme that they call a tasting menu. Essentially you are charged $75 per person and up to eat which includes 3-4 very very very small items from the menu. I don't like to boxed in with price schemes but ok - that's the way they do it here.\nThe problem is - the food does not match the price. I left with $150 bill and went home with a pretty bad stomach ache. The Duck and the Lamb were very very tough. My stomach was still upset the next morning which leads me to speculate on the age of the meat ( which I'm sure they will avow it to be fresh). Ok maybe my stomach had a bad night.\nHowever - for $150 bill you want to eat WOW and it's far from wow. It's what you would expect from a kitchen full of trained & skillful illegal immigrants for $75 dinner not a Chef run enterprise for $150 for two. I would have rather spent $300 at Le Jardin in Edgewater.\nThe desert was the biggest disappointment. Very little expertise in the desert. When you think of chocolate made by a Chef you should have no doubt in the expertise and effort in its creation. Not there. The desert reflected an effort in cost reduction and savings that was supposed to look like a chef inspired desert. Disappointing. There are entirely too many good restaurants to eat at, leave full and satisfied at $80-$100, why drop $150-$200 on something that just doesn't deliver?",
   "reviews": "46 reviews"
  },
  {
   "desc": "Although the food looked excellent, it didn't taste good. None of the flavors complimented each other. Ambiance and service was great tho. I wouldn't eat there again to be honest.",
   "reviews": "2 reviews"
  },
  {
   "reviews": "10 reviews"
  },
  {
   "reviews": "3 reviews"
  },
  {
   "reviews": "22 reviews"
  },
  {
   "desc": "This place is so hyped it is hard to be objective. The anticipation of dining here is such that the food might have a hard time measuring up because after all it is only food. The outdoor dining area is a pleasant escape for dinner. The food is beautifully presented but on the night we were there the selections were similar in ingredients and taste. Now our selections tended away from red meat so I would suggest the obvious: to get the best sampling of this restaurant that you should vary your selections (look at the ingredients and think about the proteins and the textures) to get a varied result. Friendly and attentive service. I will return but have tempered expectations. After all it's not the French Kitchen.",
   "reviews": "59 reviews"
  },
  {
   "reviews": "64 reviews"
  },
  {
   "reviews": "100 reviews"
  },
  {
   "desc": "Service/Decor 5 stars but Food only 3 stars (maybe)\nSea Bass- Excellent\nScallops- Very Good\nCrab Cake - No. Absolutely Not.\nLamb- Just alright\nDuck- Just alright\nBrown Butter Cake - Good\nKey Lime Tart- Good\nService/Decor- Beyond Amazing\nThe first waiter will tell you that the crabcake \"never leaves the menu because it's just that good\" i heard him say it to four other tables verbatim. The plan was to share everything but after all this talk about the crabcake we decided to each order our own. Mistake. I don't want to say it was awful but it certainly wasn't that good. No crab flavor or texture. Seemed like an afterthought underneath the colossal shrimp. Very disappointing.\nWould i come back? Absolutely! The beauty and the service are unmatched. Everyone was super friendly and engaging but not intrusive. There are still a few items on the menu I'd like to try but I'm for sure in no rush.",
   "reviews": "87 reviews"
  },
  {
   "desc": "Tres bien! Felt like we were in a little village in France. Wonderful service without a bit of snobbery! The food was such a plethora of delightful flavors! We loved our first experience dining at Cafe Matisse. We will be back to sit in the garden outside for our next visit! Looking forward to next time.",
   "reviews": "14 reviews"
  },
  {
   "desc": "Perfection. The service was spot on, the food was the best I've had, the atmosphere was magic! They describe the experience as a tasting menu and that the plates are \"small plates\" or something like that but my husband and I didn't see it that way!! We were more than full! Almost couldn't finish dessert after our 2+1 dinner.\nLoved it, perfect for a special occasion!",
   "reviews": "69 reviews"
  },
  {
   "desc": "Absolutely impeccable service, only to be outshined by the sublime food. Really a wonderful experience for any occasion, and always remember to invite Larry (the owner) to enjoy a glass of wine with you in this BYO restaurant (Rutherford is a dry town). We always leave feeling immensely full and extremely undercharged!",
   "reviews": "48 reviews"
  },
  {
   "reviews": "2 reviews"
  },
  {
   "desc": "Food was good not great. Expected more from a five course at $115. Service could've been a lot better. For example, when we ordered the five course servers should've kept track of what order goes to what guest; if it was only 3 of us. Desert was probably the best part. For the price and our experience as first timers probably won't come back.",
   "reviews": "8 reviews"
  },
  {
   "reviews": "7 reviews"
  },
  {
   "reviews": "10 reviews"
  },
  {
   "reviews": "51 reviews"
  },
  {
   "reviews": "274 reviews"
  },
  {
   "reviews": "2 reviews"
  },
  {
   "reviews": "24 reviews"
  },
  {
   "desc": "I'm glad that I've finally tried this place that I've bookmarked for so long. However not sure if I'll return anytime soon. The food is prepared with effort and care, the service was attentive and warm, the dining room is lovely, but I just don't think I want to pay $75 for app, entree, and dessert. I feel like I can get something comparable or better in the city for that price.\nSome dishes I enjoyed were the panko crusted crab cake and shrimp, which is always on the menu. It was tasty, but the corn bread was a tad bit salty for me. Liked the truffley foie gras with scallops. The burger was ok. Fries that came with it were meh. There was a confusion with the order so it was delivered to the wrong table. Sat there for a bit and sent back to the kitchen. Then it was delivered to me,so it wasn't hot as it should have been. Perhaps it would have tasted better had it come hotter. This dish is pretty hearty although it seems small at first. Didn't enjoy the shrimp and crab gazpacho so much. However the seafood is very fresh. Dessert was just so so for me.\nIf you want a special occasion, fine dining option in NJ then give it a try. But for me, there are better options in the city.",
   "reviews": "226 reviews"
  },
  {
   "desc": "One of the best dining experiences I have had in New Jersey. The sea bass was sublime and excellent. The scallops were so flavorful. Chocolate tart was fantastic and had a lot going on. The burger is good, but it is very rich and heavy, so you may have to watch how many courses you order if you are getting the burger because it is very filling.",
   "reviews": "24 reviews"
  },
  {
   "desc": "For those of you with a restaurant bucket list, Cafe Matisse must be at the top. While certainly not an everyday spot (unless you have that kind of cash in which case all the more power to you), it is such a lovely treat for any special occasion. My boyfriend surprised me with dinner here for our anniversary and we were treated so well the entire night. The host and the waiters all wished us a happy anniversary and I must say that, while it's a seemingly small thing, the personalized treatment felt great.\nThe unique decor is really welcoming and they're pretty serious about really it making an experience. It's supposed to be a roughly 2 hour experience so make sure that you have that time or let them know if you don't. It's BYOB so bring a bottle (or two) of your favorite wine to enjoy throughout the process.\nI think the menu changes seasonally but I'll still tell you about the cool things we ate (which you can also see in the photos).\n- Sliced Tuna: Super fresh and great quality tuna. I felt like the flatbread was a bit chewy and hard but really enjoy the toppings on it.\n- Pan Seared Scallop: Delicious, sweet scallops and the addition of the crab meat was a nice touch.\n- Spicy Panko Crab: Had a nice kick to it. I was hoping it would be a little spicier because the waiter really hyped up how spicy it is, but the flavors were delicious all the same. Loved the giant shrimp on top too!\n- Matisse Burger: Great quality meat but I'm not sure how the wings play into it. The wings kind of threw us off because on one hand you're in a super fancy restaurant but on the other hand you're eating messy wings with your hands. BUT the wings were delicious, despite being out of place.\n- Whole Wheat Brown Butter Cake: The desserts here are amazing. The butter cake was something new I've never really had before but I'd say it resembled a super soft, crumbly sugar cookie.\nI'm definitely going to recommend this place to anyone and everyone! MUST MUST MUST TRY!",
   "reviews": "493 reviews"
  },
  {
   "desc": "Having dined in wonderful restaurants both domestically and internationally, Cafe Matisse ranks with the best. The staff welcomes you as family. We dined at a beautiful table for two in the outdoor garden. 3,4 or 5 course dinner offered. For us , 3 course option works best. No point discussing menu because it's always evolving. Everything was beautifully presented and tasted great. Expect a 2 + hour dining experience, which is NOT a criticism. Matisse is an experience to be savored. We can't imagine a more romantic setting. Note: Larry and entire staff are amazing. 10% cash discount.",
   "reviews": "13 reviews"
  },
  {
   "desc": "Our fourth time and definitely not the last. The food is outstanding, service is outstanding and it was yet another memorable evening. We decided to try the five course and as usual it did not disappoint! Actually I am stuffed! I love this place and every room both inside and out gives a different experience. This evening we were in the garden and it was so lovely. Unfortunately there were a lot of planes flying above from teterboro but then you kind of forget it. This is the place for special occasions proposals etc. I love love Cafe Matisse!!!",
   "reviews": "43 reviews"
  },
  {
   "reviews": "13 reviews"
  },
  {
   "reviews": "15 reviews"
  },
  {
   "reviews": "3 reviews"
  },
  {
   "reviews": "20 reviews"
  },
  {
   "desc": "We went there because it was supposedly one of the best French restaurants in NJ and it didn't disappoint! The portions were smaller but full of rich delicious flavor and I have to admit I was stuffed after three courses. The artichoke/goat cheese coarse and scallop/duck coarse did nothing but tantalize our taste buds. The waiting staff was so attentive of our needs at every point of the meal even in the beginning when my husband didn't realize it was BYOB and ran out real quick to grab a bottle of red. If you are a French food fanatic like I am I highly suggest it taking a visit to this place! We drove over an hour to go there and it was totally worth it!",
   "reviews": "7 reviews"
  },
  {
   "reviews": "2 reviews"
  },
  {
   "desc": "This is my go to spot for any Special occasion. I'm the type of guy that always has a hard time picking between dishes\"should I get this should I get that and the always that's looks great I knew I should have gotten that\" but with this Menu I get a little of everything and I'm always happy. So if you and someone you love are looking for a great night out this is a Wonderful choice. If you plan on sitting outside call a few days ahead? The outside garden fills up quick.",
   "reviews": "1 review"
  },
  {
   "desc": "I am so happy we stumbled upon this cute little restaurant. Hubbs and I were in Jersey, on our way to a concert so we weren't quite dressed for this type of establishment but we didn't have many options and the reviews were just too good to pass up. I made reservations as we were driving and they had plenty of seating available. I read that they're BYOB so we stopped a few blocks away at a liquor store and picked up a bottle of vodka; hubby can't drink wine so we pickup something we could both enjoy.\nWe were seated immediately upon arrival and the staff was very nice; I'm sure we received a lot of double takes because of how we were dressed but they were still very gracious and didn't make us feel unwelcome. I loved the dining room decor; apparently, they redecorate the dining room and we visited when is was the jewelry box theme. It made me feel like we were in an Alice In Wonderland story. The concept of their menu is pre fixe and you have a choice of how many courses you would like. All of the dishes are small plates and you choose each course, paying one price for either 3, 4 or 5 courses. Each choice includes a dessert course and a number of savory courses, adding up to the option you chose. We asked for a chaser for our vodka and they offered us juice to make mixed drinks at the table.\nHubbs started off with Tacos and loved them. I had what was supposed to be Diver Scallops but instead were very large sea scallops that were sliced. I compared my dish to the same dish someone else posted and I was definitely lacking scallop girth, but I digress. The food is phenomenal and regardless of my scallop size, it is evident that Chef Loria takes great pleasure in producing such fine works of edible art.\nFor our second course, hubbs enjoyed the Bison Medallion with Onion Ribbons and I loved my Venison with Bay Scallops. We each had a dessert as well, my Bittersweet Chocolate Tart and his hubby's Key Lime Pie. Everything was detectable; we enjoyed every single bite and our dining experience was worth the awkwardness in the beginning. The menu changes, seasonally, so the concept may be similar but the proteins may be different from menu to menu. I definitely want to go back and check out their new dining room which is supposedly a Moroccan theme now but I think we'll dress up a bit for our next visit.",
   "reviews": "1047 reviews"
  },
  {
   "desc": "If I only had one word for the review, it would be phenomenal. I was looking for a restaurant to go to for a celebration dinner. I stumbled upon this place by reading an article about the top 5 most expensive restaurants in NJ and this was on the list. So after choosing this place I had to make a reservation 2 weeks in advance to get a Friday night dinner.\nOnce we walked into the restaurant it reeked of freshly baked brownies. Def a good thing cause it smelled great. Then a man asked if I was David after I said yes he greeted us and brought us to our table. I felt very special that he knew my name. He would be our host/waiter and I liked him a lot. A very nice man who made us feel very welcome. As soon as we sat he complimented me on my bottle of VSOP cognac. This made me feel extra happy because I was a little nervous about bringing in liquor that wasn't beer or wine. After that, they brought us a wine glass for my wife and a snifter for my cognac. With the 2 glasses came a glass full of different olives, this was nice to munch on while we had our first drink and looked at the menu. This place was batting a thousand so far.\nThe host then explained how the menu works. You choose either a 3-course meal (75$) or a 4-course meal (95$). Dessert counts as a course so I went with the 4-course meal. Then the host told us to not be in a rush because the whole experience would take about 2 hours. I loved this, all week we work hard and eat in a rush so we could move on quicker. This was nice to take our time relax, have a drink, and enjoy each others company while we eat a superb meal.\nThe ambience was great, dim lighting and a candlelit dinner. They also look like they have an area in the back that's outdoor. I will definitely sit there next time it's hot. The service was impeccable with water always filled and new forks and knives for each course.\nFor my 4 courses, I chose the tuna and crudo, crab cake, and duck to finish. Every course was amazing. It was like my taste buds went on vacation. Each dish had so much going on it made me want to get each ingredient on every bite. This is the best dining experience I've had in new jersey, maybe even my life. Everything was cooked perfectly and I wish I could come here more often. It's expensive so I can only come here for special occasions.\nI got the butter cake for dessert which was delicious but it paled in comparison to the complex flavors of the main courses. Then I ended with a macchiato coffee. It was the tastiest coffee I've ever had.\nAll in all this dinner was worth every penny. It was a great night out with my lovely wife. This restaurant should be treated like going to the opera or an expensive concert. If you're a foodie, experience it for yourself.",
   "reviews": "124 reviews"
  },
  {
   "reviews": "4 reviews"
  },
  {
   "reviews": "443 reviews"
  },
  {
   "reviews": "6 reviews"
  },
  {
   "reviews": "152 reviews"
  },
  {
   "desc": "Our absolute favorite spot for special occasions. Larry is the man. The outdoor garden is majestic.",
   "reviews": "3 reviews"
  },
  {
   "desc": "A little disappointed on the taste...compared to its overall rates, the price and where it wants to go. Service, and atmosphere are great though. Worth a try then it will up to you if you are coming back. Also note they dont sell wine/alcohol, but welcome you to bring your own.",
   "reviews": "47 reviews"
  },
  {
   "desc": "I set out searching for a French restaurant in the area and Cafe Matisse came up on Yelp as American Cuisine ( substitute for French) For starters - the menu is a weird scheme that they call a tasting menu. Essentially you are charged $75 per person and up to eat which includes 3-4 very very very small items from the menu. I don't like to boxed in with price schemes but ok - that's the way they do it here.\nThe problem is - the food does not match the price. I left with $150 bill and went home with a pretty bad stomach ache. The Duck and the Lamb were very very tough. My stomach was still upset the next morning which leads me to speculate on the age of the meat ( which I'm sure they will avow it to be fresh). Ok maybe my stomach had a bad night.\nHowever - for $150 bill you want to eat WOW and it's far from wow. It's what you would expect from a kitchen full of trained & skillful illegal immigrants for $75 dinner not a Chef run enterprise for $150 for two. I would have rather spent $300 at Le Jardin in Edgewater.\nThe desert was the biggest disappointment. Very little expertise in the desert. When you think of chocolate made by a Chef you should have no doubt in the expertise and effort in its creation. Not there. The desert reflected an effort in cost reduction and savings that was supposed to look like a chef inspired desert. Disappointing. There are entirely too many good restaurants to eat at, leave full and satisfied at $80-$100, why drop $150-$200 on something that just doesn't deliver?",
   "reviews": "46 reviews"
  },
  {
   "desc": "Although the food looked excellent, it didn't taste good. None of the flavors complimented each other. Ambiance and service was great tho. I wouldn't eat there again to be honest.",
   "reviews": "2 reviews"
  },
  {
   "reviews": "10 reviews"
  },
  {
   "reviews": "3 reviews"
  },
  {
   "reviews": "22 reviews"
  },
  {
   "desc": "This place is so hyped it is hard to be objective. The anticipation of dining here is such that the food might have a hard time measuring up because after all it is only food. The outdoor dining area is a pleasant escape for dinner. The food is beautifully presented but on the night we were there the selections were similar in ingredients and taste. Now our selections tended away from red meat so I would suggest the obvious: to get the best sampling of this restaurant that you should vary your selections (look at the ingredients and think about the proteins and the textures) to get a varied result. Friendly and attentive service. I will return but have tempered expectations. After all it's not the French Kitchen.",
   "reviews": "59 reviews"
  },
  {
   "reviews": "64 reviews"
  },
  {
   "reviews": "100 reviews"
  },
  {
   "desc": "Service/Decor 5 stars but Food only 3 stars (maybe)\nSea Bass- Excellent\nScallops- Very Good\nCrab Cake - No. Absolutely Not.\nLamb- Just alright\nDuck- Just alright\nBrown Butter Cake - Good\nKey Lime Tart- Good\nService/Decor- Beyond Amazing\nThe first waiter will tell you that the crabcake \"never leaves the menu because it's just that good\" i heard him say it to four other tables verbatim. The plan was to share everything but after all this talk about the crabcake we decided to each order our own. Mistake. I don't want to say it was awful but it certainly wasn't that good. No crab flavor or texture. Seemed like an afterthought underneath the colossal shrimp. Very disappointing.\nWould i come back? Absolutely! The beauty and the service are unmatched. Everyone was super friendly and engaging but not intrusive. There are still a few items on the menu I'd like to try but I'm for sure in no rush.",
   "reviews": "87 reviews"
  },
  {
   "desc": "Tres bien! Felt like we were in a little village in France. Wonderful service without a bit of snobbery! The food was such a plethora of delightful flavors! We loved our first experience dining at Cafe Matisse. We will be back to sit in the garden outside for our next visit! Looking forward to next time.",
   "reviews": "14 reviews"
  },
  {
   "desc": "Perfection. The service was spot on, the food was the best I've had, the atmosphere was magic! They describe the experience as a tasting menu and that the plates are \"small plates\" or something like that but my husband and I didn't see it that way!! We were more than full! Almost couldn't finish dessert after our 2+1 dinner.\nLoved it, perfect for a special occasion!",
   "reviews": "69 reviews"
  }
 ]
}